zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_XRDC.h
/*! @name CR - Control */
/*! @{ */

#define CPE_XRDC_CR_GVLD_MASK                    (0x1U)
#define CPE_XRDC_CR_GVLD_SHIFT                   (0U)
#define CPE_XRDC_CR_GVLD_WIDTH                   (1U)
#define CPE_XRDC_CR_GVLD(x)                      (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_CR_GVLD_SHIFT)) & CPE_XRDC_CR_GVLD_MASK)

#define CPE_XRDC_CR_HRL_MASK                     (0x1EU)
#define CPE_XRDC_CR_HRL_SHIFT                    (1U)
#define CPE_XRDC_CR_HRL_WIDTH                    (4U)
#define CPE_XRDC_CR_HRL(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_CR_HRL_SHIFT)) & CPE_XRDC_CR_HRL_MASK)

#define CPE_XRDC_CR_MRF_MASK                     (0x80U)
#define CPE_XRDC_CR_MRF_SHIFT                    (7U)
#define CPE_XRDC_CR_MRF_WIDTH                    (1U)
#define CPE_XRDC_CR_MRF(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_CR_MRF_SHIFT)) & CPE_XRDC_CR_MRF_MASK)

#define CPE_XRDC_CR_VAW_MASK                     (0x100U)
#define CPE_XRDC_CR_VAW_SHIFT                    (8U)
#define CPE_XRDC_CR_VAW_WIDTH                    (1U)
#define CPE_XRDC_CR_VAW(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_CR_VAW_SHIFT)) & CPE_XRDC_CR_VAW_MASK)

#define CPE_XRDC_CR_LK1_MASK                     (0x40000000U)
#define CPE_XRDC_CR_LK1_SHIFT                    (30U)
#define CPE_XRDC_CR_LK1_WIDTH                    (1U)
#define CPE_XRDC_CR_LK1(x)                       (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_CR_LK1_SHIFT)) & CPE_XRDC_CR_LK1_MASK)
/*! @} */

/*! @name HWCFG0 - Hardware Configuration 0 */
/*! @{ */

#define CPE_XRDC_HWCFG0_NDID_MASK                (0xFFU)
#define CPE_XRDC_HWCFG0_NDID_SHIFT               (0U)
#define CPE_XRDC_HWCFG0_NDID_WIDTH               (8U)
#define CPE_XRDC_HWCFG0_NDID(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG0_NDID_SHIFT)) & CPE_XRDC_HWCFG0_NDID_MASK)

#define CPE_XRDC_HWCFG0_NMSTR_MASK               (0xFF00U)
#define CPE_XRDC_HWCFG0_NMSTR_SHIFT              (8U)
#define CPE_XRDC_HWCFG0_NMSTR_WIDTH              (8U)
#define CPE_XRDC_HWCFG0_NMSTR(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG0_NMSTR_SHIFT)) & CPE_XRDC_HWCFG0_NMSTR_MASK)

#define CPE_XRDC_HWCFG0_NMRC_MASK                (0xFF0000U)
#define CPE_XRDC_HWCFG0_NMRC_SHIFT               (16U)
#define CPE_XRDC_HWCFG0_NMRC_WIDTH               (8U)
#define CPE_XRDC_HWCFG0_NMRC(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG0_NMRC_SHIFT)) & CPE_XRDC_HWCFG0_NMRC_MASK)

#define CPE_XRDC_HWCFG0_NPAC_MASK                (0xF000000U)
#define CPE_XRDC_HWCFG0_NPAC_SHIFT               (24U)
#define CPE_XRDC_HWCFG0_NPAC_WIDTH               (4U)
#define CPE_XRDC_HWCFG0_NPAC(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG0_NPAC_SHIFT)) & CPE_XRDC_HWCFG0_NPAC_MASK)

#define CPE_XRDC_HWCFG0_MID_MASK                 (0xF0000000U)
#define CPE_XRDC_HWCFG0_MID_SHIFT                (28U)
#define CPE_XRDC_HWCFG0_MID_WIDTH                (4U)
#define CPE_XRDC_HWCFG0_MID(x)                   (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG0_MID_SHIFT)) & CPE_XRDC_HWCFG0_MID_MASK)
/*! @} */

/*! @name HWCFG1 - Hardware Configuration 1 */
/*! @{ */

#define CPE_XRDC_HWCFG1_DID_MASK                 (0xFU)
#define CPE_XRDC_HWCFG1_DID_SHIFT                (0U)
#define CPE_XRDC_HWCFG1_DID_WIDTH                (4U)
#define CPE_XRDC_HWCFG1_DID(x)                   (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG1_DID_SHIFT)) & CPE_XRDC_HWCFG1_DID_MASK)
/*! @} */

/*! @name HWCFG2 - Hardware Configuration 2 */
/*! @{ */

#define CPE_XRDC_HWCFG2_PIDP0_MASK               (0x1U)
#define CPE_XRDC_HWCFG2_PIDP0_SHIFT              (0U)
#define CPE_XRDC_HWCFG2_PIDP0_WIDTH              (1U)
#define CPE_XRDC_HWCFG2_PIDP0(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP0_SHIFT)) & CPE_XRDC_HWCFG2_PIDP0_MASK)

#define CPE_XRDC_HWCFG2_PIDP1_MASK               (0x2U)
#define CPE_XRDC_HWCFG2_PIDP1_SHIFT              (1U)
#define CPE_XRDC_HWCFG2_PIDP1_WIDTH              (1U)
#define CPE_XRDC_HWCFG2_PIDP1(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP1_SHIFT)) & CPE_XRDC_HWCFG2_PIDP1_MASK)

#define CPE_XRDC_HWCFG2_PIDP2_MASK               (0x4U)
#define CPE_XRDC_HWCFG2_PIDP2_SHIFT              (2U)
#define CPE_XRDC_HWCFG2_PIDP2_WIDTH              (1U)
#define CPE_XRDC_HWCFG2_PIDP2(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP2_SHIFT)) & CPE_XRDC_HWCFG2_PIDP2_MASK)

#define CPE_XRDC_HWCFG2_PIDP3_MASK               (0x8U)
#define CPE_XRDC_HWCFG2_PIDP3_SHIFT              (3U)
#define CPE_XRDC_HWCFG2_PIDP3_WIDTH              (1U)
#define CPE_XRDC_HWCFG2_PIDP3(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP3_SHIFT)) & CPE_XRDC_HWCFG2_PIDP3_MASK)

#define CPE_XRDC_HWCFG2_PIDP4_MASK               (0x10U)
#define CPE_XRDC_HWCFG2_PIDP4_SHIFT              (4U)
#define CPE_XRDC_HWCFG2_PIDP4_WIDTH              (1U)
#define CPE_XRDC_HWCFG2_PIDP4(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP4_SHIFT)) & CPE_XRDC_HWCFG2_PIDP4_MASK)

#define CPE_XRDC_HWCFG2_PIDP5_MASK               (0x20U)
#define CPE_XRDC_HWCFG2_PIDP5_SHIFT              (5U)
#define CPE_XRDC_HWCFG2_PIDP5_WIDTH              (1U)
#define CPE_XRDC_HWCFG2_PIDP5(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP5_SHIFT)) & CPE_XRDC_HWCFG2_PIDP5_MASK)

#define CPE_XRDC_HWCFG2_PIDP6_MASK               (0x40U)
#define CPE_XRDC_HWCFG2_PIDP6_SHIFT              (6U)
#define CPE_XRDC_HWCFG2_PIDP6_WIDTH              (1U)
#define CPE_XRDC_HWCFG2_PIDP6(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP6_SHIFT)) & CPE_XRDC_HWCFG2_PIDP6_MASK)

#define CPE_XRDC_HWCFG2_PIDP7_MASK               (0x80U)
#define CPE_XRDC_HWCFG2_PIDP7_SHIFT              (7U)
#define CPE_XRDC_HWCFG2_PIDP7_WIDTH              (1U)
#define CPE_XRDC_HWCFG2_PIDP7(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP7_SHIFT)) & CPE_XRDC_HWCFG2_PIDP7_MASK)

#define CPE_XRDC_HWCFG2_PIDP8_MASK               (0x100U)
#define CPE_XRDC_HWCFG2_PIDP8_SHIFT              (8U)
#define CPE_XRDC_HWCFG2_PIDP8_WIDTH              (1U)
#define CPE_XRDC_HWCFG2_PIDP8(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP8_SHIFT)) & CPE_XRDC_HWCFG2_PIDP8_MASK)

#define CPE_XRDC_HWCFG2_PIDP9_MASK               (0x200U)
#define CPE_XRDC_HWCFG2_PIDP9_SHIFT              (9U)
#define CPE_XRDC_HWCFG2_PIDP9_WIDTH              (1U)
#define CPE_XRDC_HWCFG2_PIDP9(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP9_SHIFT)) & CPE_XRDC_HWCFG2_PIDP9_MASK)

#define CPE_XRDC_HWCFG2_PIDP10_MASK              (0x400U)
#define CPE_XRDC_HWCFG2_PIDP10_SHIFT             (10U)
#define CPE_XRDC_HWCFG2_PIDP10_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP10(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP10_SHIFT)) & CPE_XRDC_HWCFG2_PIDP10_MASK)

#define CPE_XRDC_HWCFG2_PIDP11_MASK              (0x800U)
#define CPE_XRDC_HWCFG2_PIDP11_SHIFT             (11U)
#define CPE_XRDC_HWCFG2_PIDP11_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP11(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP11_SHIFT)) & CPE_XRDC_HWCFG2_PIDP11_MASK)

#define CPE_XRDC_HWCFG2_PIDP12_MASK              (0x1000U)
#define CPE_XRDC_HWCFG2_PIDP12_SHIFT             (12U)
#define CPE_XRDC_HWCFG2_PIDP12_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP12(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP12_SHIFT)) & CPE_XRDC_HWCFG2_PIDP12_MASK)

#define CPE_XRDC_HWCFG2_PIDP13_MASK              (0x2000U)
#define CPE_XRDC_HWCFG2_PIDP13_SHIFT             (13U)
#define CPE_XRDC_HWCFG2_PIDP13_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP13(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP13_SHIFT)) & CPE_XRDC_HWCFG2_PIDP13_MASK)

#define CPE_XRDC_HWCFG2_PIDP14_MASK              (0x4000U)
#define CPE_XRDC_HWCFG2_PIDP14_SHIFT             (14U)
#define CPE_XRDC_HWCFG2_PIDP14_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP14(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP14_SHIFT)) & CPE_XRDC_HWCFG2_PIDP14_MASK)

