zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_XRDC.h
#define CPE_XRDC_HWCFG2_PIDP15_MASK              (0x8000U)
#define CPE_XRDC_HWCFG2_PIDP15_SHIFT             (15U)
#define CPE_XRDC_HWCFG2_PIDP15_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP15(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP15_SHIFT)) & CPE_XRDC_HWCFG2_PIDP15_MASK)

#define CPE_XRDC_HWCFG2_PIDP16_MASK              (0x10000U)
#define CPE_XRDC_HWCFG2_PIDP16_SHIFT             (16U)
#define CPE_XRDC_HWCFG2_PIDP16_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP16(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP16_SHIFT)) & CPE_XRDC_HWCFG2_PIDP16_MASK)

#define CPE_XRDC_HWCFG2_PIDP17_MASK              (0x20000U)
#define CPE_XRDC_HWCFG2_PIDP17_SHIFT             (17U)
#define CPE_XRDC_HWCFG2_PIDP17_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP17(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP17_SHIFT)) & CPE_XRDC_HWCFG2_PIDP17_MASK)

#define CPE_XRDC_HWCFG2_PIDP18_MASK              (0x40000U)
#define CPE_XRDC_HWCFG2_PIDP18_SHIFT             (18U)
#define CPE_XRDC_HWCFG2_PIDP18_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP18(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP18_SHIFT)) & CPE_XRDC_HWCFG2_PIDP18_MASK)

#define CPE_XRDC_HWCFG2_PIDP19_MASK              (0x80000U)
#define CPE_XRDC_HWCFG2_PIDP19_SHIFT             (19U)
#define CPE_XRDC_HWCFG2_PIDP19_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP19(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP19_SHIFT)) & CPE_XRDC_HWCFG2_PIDP19_MASK)

#define CPE_XRDC_HWCFG2_PIDP20_MASK              (0x100000U)
#define CPE_XRDC_HWCFG2_PIDP20_SHIFT             (20U)
#define CPE_XRDC_HWCFG2_PIDP20_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP20(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP20_SHIFT)) & CPE_XRDC_HWCFG2_PIDP20_MASK)

#define CPE_XRDC_HWCFG2_PIDP21_MASK              (0x200000U)
#define CPE_XRDC_HWCFG2_PIDP21_SHIFT             (21U)
#define CPE_XRDC_HWCFG2_PIDP21_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP21(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP21_SHIFT)) & CPE_XRDC_HWCFG2_PIDP21_MASK)

#define CPE_XRDC_HWCFG2_PIDP22_MASK              (0x400000U)
#define CPE_XRDC_HWCFG2_PIDP22_SHIFT             (22U)
#define CPE_XRDC_HWCFG2_PIDP22_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP22(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP22_SHIFT)) & CPE_XRDC_HWCFG2_PIDP22_MASK)

#define CPE_XRDC_HWCFG2_PIDP23_MASK              (0x800000U)
#define CPE_XRDC_HWCFG2_PIDP23_SHIFT             (23U)
#define CPE_XRDC_HWCFG2_PIDP23_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP23(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP23_SHIFT)) & CPE_XRDC_HWCFG2_PIDP23_MASK)

#define CPE_XRDC_HWCFG2_PIDP24_MASK              (0x1000000U)
#define CPE_XRDC_HWCFG2_PIDP24_SHIFT             (24U)
#define CPE_XRDC_HWCFG2_PIDP24_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP24(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP24_SHIFT)) & CPE_XRDC_HWCFG2_PIDP24_MASK)

#define CPE_XRDC_HWCFG2_PIDP25_MASK              (0x2000000U)
#define CPE_XRDC_HWCFG2_PIDP25_SHIFT             (25U)
#define CPE_XRDC_HWCFG2_PIDP25_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP25(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP25_SHIFT)) & CPE_XRDC_HWCFG2_PIDP25_MASK)

#define CPE_XRDC_HWCFG2_PIDP26_MASK              (0x4000000U)
#define CPE_XRDC_HWCFG2_PIDP26_SHIFT             (26U)
#define CPE_XRDC_HWCFG2_PIDP26_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP26(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP26_SHIFT)) & CPE_XRDC_HWCFG2_PIDP26_MASK)

#define CPE_XRDC_HWCFG2_PIDP27_MASK              (0x8000000U)
#define CPE_XRDC_HWCFG2_PIDP27_SHIFT             (27U)
#define CPE_XRDC_HWCFG2_PIDP27_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP27(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP27_SHIFT)) & CPE_XRDC_HWCFG2_PIDP27_MASK)

#define CPE_XRDC_HWCFG2_PIDP28_MASK              (0x10000000U)
#define CPE_XRDC_HWCFG2_PIDP28_SHIFT             (28U)
#define CPE_XRDC_HWCFG2_PIDP28_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP28(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP28_SHIFT)) & CPE_XRDC_HWCFG2_PIDP28_MASK)

#define CPE_XRDC_HWCFG2_PIDP29_MASK              (0x20000000U)
#define CPE_XRDC_HWCFG2_PIDP29_SHIFT             (29U)
#define CPE_XRDC_HWCFG2_PIDP29_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP29(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP29_SHIFT)) & CPE_XRDC_HWCFG2_PIDP29_MASK)

#define CPE_XRDC_HWCFG2_PIDP30_MASK              (0x40000000U)
#define CPE_XRDC_HWCFG2_PIDP30_SHIFT             (30U)
#define CPE_XRDC_HWCFG2_PIDP30_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP30(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP30_SHIFT)) & CPE_XRDC_HWCFG2_PIDP30_MASK)

#define CPE_XRDC_HWCFG2_PIDP31_MASK              (0x80000000U)
#define CPE_XRDC_HWCFG2_PIDP31_SHIFT             (31U)
#define CPE_XRDC_HWCFG2_PIDP31_WIDTH             (1U)
#define CPE_XRDC_HWCFG2_PIDP31(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_HWCFG2_PIDP31_SHIFT)) & CPE_XRDC_HWCFG2_PIDP31_MASK)
/*! @} */

/*! @name MDACFG - Master Domain Assignment Configuration */
/*! @{ */

#define CPE_XRDC_MDACFG_NMDAR_MASK               (0xFU)
#define CPE_XRDC_MDACFG_NMDAR_SHIFT              (0U)
#define CPE_XRDC_MDACFG_NMDAR_WIDTH              (4U)
#define CPE_XRDC_MDACFG_NMDAR(x)                 (((uint8_t)(((uint8_t)(x)) << CPE_XRDC_MDACFG_NMDAR_SHIFT)) & CPE_XRDC_MDACFG_NMDAR_MASK)

#define CPE_XRDC_MDACFG_NCM_MASK                 (0x80U)
#define CPE_XRDC_MDACFG_NCM_SHIFT                (7U)
#define CPE_XRDC_MDACFG_NCM_WIDTH                (1U)
#define CPE_XRDC_MDACFG_NCM(x)                   (((uint8_t)(((uint8_t)(x)) << CPE_XRDC_MDACFG_NCM_SHIFT)) & CPE_XRDC_MDACFG_NCM_MASK)
/*! @} */

/*! @name MRCFG - Memory Region Configuration */
/*! @{ */

#define CPE_XRDC_MRCFG_NMRGD_MASK                (0x1FU)
#define CPE_XRDC_MRCFG_NMRGD_SHIFT               (0U)
#define CPE_XRDC_MRCFG_NMRGD_WIDTH               (5U)
#define CPE_XRDC_MRCFG_NMRGD(x)                  (((uint8_t)(((uint8_t)(x)) << CPE_XRDC_MRCFG_NMRGD_SHIFT)) & CPE_XRDC_MRCFG_NMRGD_MASK)
/*! @} */

/*! @name DERRLOC - Domain Error Location */
/*! @{ */

