zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_XRDC.h
#define CPE_XRDC_DERRLOC_MRCINST_MASK            (0xFFFFU)
#define CPE_XRDC_DERRLOC_MRCINST_SHIFT           (0U)
#define CPE_XRDC_DERRLOC_MRCINST_WIDTH           (16U)
#define CPE_XRDC_DERRLOC_MRCINST(x)              (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_DERRLOC_MRCINST_SHIFT)) & CPE_XRDC_DERRLOC_MRCINST_MASK)

#define CPE_XRDC_DERRLOC_PACINST_MASK            (0xF0000U)
#define CPE_XRDC_DERRLOC_PACINST_SHIFT           (16U)
#define CPE_XRDC_DERRLOC_PACINST_WIDTH           (4U)
#define CPE_XRDC_DERRLOC_PACINST(x)              (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_DERRLOC_PACINST_SHIFT)) & CPE_XRDC_DERRLOC_PACINST_MASK)
/*! @} */

/*! @name DERR_W0 - Domain Error Word 0 */
/*! @{ */

#define CPE_XRDC_DERR_W0_EADDR_MASK              (0xFFFFFFFFU)
#define CPE_XRDC_DERR_W0_EADDR_SHIFT             (0U)
#define CPE_XRDC_DERR_W0_EADDR_WIDTH             (32U)
#define CPE_XRDC_DERR_W0_EADDR(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_DERR_W0_EADDR_SHIFT)) & CPE_XRDC_DERR_W0_EADDR_MASK)
/*! @} */

/*! @name DERR_W1 - Domain Error Word 1 */
/*! @{ */

#define CPE_XRDC_DERR_W1_EDID_MASK               (0xFU)
#define CPE_XRDC_DERR_W1_EDID_SHIFT              (0U)
#define CPE_XRDC_DERR_W1_EDID_WIDTH              (4U)
#define CPE_XRDC_DERR_W1_EDID(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_DERR_W1_EDID_SHIFT)) & CPE_XRDC_DERR_W1_EDID_MASK)

#define CPE_XRDC_DERR_W1_EATR_MASK               (0x700U)
#define CPE_XRDC_DERR_W1_EATR_SHIFT              (8U)
#define CPE_XRDC_DERR_W1_EATR_WIDTH              (3U)
#define CPE_XRDC_DERR_W1_EATR(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_DERR_W1_EATR_SHIFT)) & CPE_XRDC_DERR_W1_EATR_MASK)

#define CPE_XRDC_DERR_W1_ERW_MASK                (0x800U)
#define CPE_XRDC_DERR_W1_ERW_SHIFT               (11U)
#define CPE_XRDC_DERR_W1_ERW_WIDTH               (1U)
#define CPE_XRDC_DERR_W1_ERW(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_DERR_W1_ERW_SHIFT)) & CPE_XRDC_DERR_W1_ERW_MASK)

#define CPE_XRDC_DERR_W1_EPORT_MASK              (0x7000000U)
#define CPE_XRDC_DERR_W1_EPORT_SHIFT             (24U)
#define CPE_XRDC_DERR_W1_EPORT_WIDTH             (3U)
#define CPE_XRDC_DERR_W1_EPORT(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_DERR_W1_EPORT_SHIFT)) & CPE_XRDC_DERR_W1_EPORT_MASK)

#define CPE_XRDC_DERR_W1_EST_MASK                (0xC0000000U)
#define CPE_XRDC_DERR_W1_EST_SHIFT               (30U)
#define CPE_XRDC_DERR_W1_EST_WIDTH               (2U)
#define CPE_XRDC_DERR_W1_EST(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_DERR_W1_EST_SHIFT)) & CPE_XRDC_DERR_W1_EST_MASK)
/*! @} */

/*! @name DERR_W3 - Domain Error Word 3 */
/*! @{ */

#define CPE_XRDC_DERR_W3_RECR_MASK               (0xC0000000U)
#define CPE_XRDC_DERR_W3_RECR_SHIFT              (30U)
#define CPE_XRDC_DERR_W3_RECR_WIDTH              (2U)
#define CPE_XRDC_DERR_W3_RECR(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_DERR_W3_RECR_SHIFT)) & CPE_XRDC_DERR_W3_RECR_MASK)
/*! @} */

/*! @name MDA_W0_0_DFMT1 - Master Domain Assignment */
/*! @{ */

#define CPE_XRDC_MDA_W0_0_DFMT1_DID_MASK         (0xFU)
#define CPE_XRDC_MDA_W0_0_DFMT1_DID_SHIFT        (0U)
#define CPE_XRDC_MDA_W0_0_DFMT1_DID_WIDTH        (4U)
#define CPE_XRDC_MDA_W0_0_DFMT1_DID(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W0_0_DFMT1_DID_SHIFT)) & CPE_XRDC_MDA_W0_0_DFMT1_DID_MASK)

#define CPE_XRDC_MDA_W0_0_DFMT1_PA_MASK          (0x30U)
#define CPE_XRDC_MDA_W0_0_DFMT1_PA_SHIFT         (4U)
#define CPE_XRDC_MDA_W0_0_DFMT1_PA_WIDTH         (2U)
#define CPE_XRDC_MDA_W0_0_DFMT1_PA(x)            (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W0_0_DFMT1_PA_SHIFT)) & CPE_XRDC_MDA_W0_0_DFMT1_PA_MASK)

#define CPE_XRDC_MDA_W0_0_DFMT1_SA_MASK          (0xC0U)
#define CPE_XRDC_MDA_W0_0_DFMT1_SA_SHIFT         (6U)
#define CPE_XRDC_MDA_W0_0_DFMT1_SA_WIDTH         (2U)
#define CPE_XRDC_MDA_W0_0_DFMT1_SA(x)            (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W0_0_DFMT1_SA_SHIFT)) & CPE_XRDC_MDA_W0_0_DFMT1_SA_MASK)

#define CPE_XRDC_MDA_W0_0_DFMT1_DIDB_MASK        (0x100U)
#define CPE_XRDC_MDA_W0_0_DFMT1_DIDB_SHIFT       (8U)
#define CPE_XRDC_MDA_W0_0_DFMT1_DIDB_WIDTH       (1U)
#define CPE_XRDC_MDA_W0_0_DFMT1_DIDB(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W0_0_DFMT1_DIDB_SHIFT)) & CPE_XRDC_MDA_W0_0_DFMT1_DIDB_MASK)

#define CPE_XRDC_MDA_W0_0_DFMT1_LPID_MASK        (0xF000000U)
#define CPE_XRDC_MDA_W0_0_DFMT1_LPID_SHIFT       (24U)
#define CPE_XRDC_MDA_W0_0_DFMT1_LPID_WIDTH       (4U)
#define CPE_XRDC_MDA_W0_0_DFMT1_LPID(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W0_0_DFMT1_LPID_SHIFT)) & CPE_XRDC_MDA_W0_0_DFMT1_LPID_MASK)

#define CPE_XRDC_MDA_W0_0_DFMT1_LPE_MASK         (0x10000000U)
#define CPE_XRDC_MDA_W0_0_DFMT1_LPE_SHIFT        (28U)
#define CPE_XRDC_MDA_W0_0_DFMT1_LPE_WIDTH        (1U)
#define CPE_XRDC_MDA_W0_0_DFMT1_LPE(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W0_0_DFMT1_LPE_SHIFT)) & CPE_XRDC_MDA_W0_0_DFMT1_LPE_MASK)

#define CPE_XRDC_MDA_W0_0_DFMT1_DFMT_MASK        (0x20000000U)
#define CPE_XRDC_MDA_W0_0_DFMT1_DFMT_SHIFT       (29U)
#define CPE_XRDC_MDA_W0_0_DFMT1_DFMT_WIDTH       (1U)
#define CPE_XRDC_MDA_W0_0_DFMT1_DFMT(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W0_0_DFMT1_DFMT_SHIFT)) & CPE_XRDC_MDA_W0_0_DFMT1_DFMT_MASK)

#define CPE_XRDC_MDA_W0_0_DFMT1_LK1_MASK         (0x40000000U)
#define CPE_XRDC_MDA_W0_0_DFMT1_LK1_SHIFT        (30U)
#define CPE_XRDC_MDA_W0_0_DFMT1_LK1_WIDTH        (1U)
#define CPE_XRDC_MDA_W0_0_DFMT1_LK1(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W0_0_DFMT1_LK1_SHIFT)) & CPE_XRDC_MDA_W0_0_DFMT1_LK1_MASK)

#define CPE_XRDC_MDA_W0_0_DFMT1_VLD_MASK         (0x80000000U)
#define CPE_XRDC_MDA_W0_0_DFMT1_VLD_SHIFT        (31U)
#define CPE_XRDC_MDA_W0_0_DFMT1_VLD_WIDTH        (1U)
#define CPE_XRDC_MDA_W0_0_DFMT1_VLD(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W0_0_DFMT1_VLD_SHIFT)) & CPE_XRDC_MDA_W0_0_DFMT1_VLD_MASK)
/*! @} */

/*! @name MDA_W1_0_DFMT1 - Master Domain Assignment */
/*! @{ */

#define CPE_XRDC_MDA_W1_0_DFMT1_DID_MASK         (0xFU)
#define CPE_XRDC_MDA_W1_0_DFMT1_DID_SHIFT        (0U)
#define CPE_XRDC_MDA_W1_0_DFMT1_DID_WIDTH        (4U)
#define CPE_XRDC_MDA_W1_0_DFMT1_DID(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W1_0_DFMT1_DID_SHIFT)) & CPE_XRDC_MDA_W1_0_DFMT1_DID_MASK)

#define CPE_XRDC_MDA_W1_0_DFMT1_PA_MASK          (0x30U)
#define CPE_XRDC_MDA_W1_0_DFMT1_PA_SHIFT         (4U)
#define CPE_XRDC_MDA_W1_0_DFMT1_PA_WIDTH         (2U)
#define CPE_XRDC_MDA_W1_0_DFMT1_PA(x)            (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W1_0_DFMT1_PA_SHIFT)) & CPE_XRDC_MDA_W1_0_DFMT1_PA_MASK)

#define CPE_XRDC_MDA_W1_0_DFMT1_SA_MASK          (0xC0U)
#define CPE_XRDC_MDA_W1_0_DFMT1_SA_SHIFT         (6U)
#define CPE_XRDC_MDA_W1_0_DFMT1_SA_WIDTH         (2U)
#define CPE_XRDC_MDA_W1_0_DFMT1_SA(x)            (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W1_0_DFMT1_SA_SHIFT)) & CPE_XRDC_MDA_W1_0_DFMT1_SA_MASK)

#define CPE_XRDC_MDA_W1_0_DFMT1_DIDB_MASK        (0x100U)
#define CPE_XRDC_MDA_W1_0_DFMT1_DIDB_SHIFT       (8U)
#define CPE_XRDC_MDA_W1_0_DFMT1_DIDB_WIDTH       (1U)
#define CPE_XRDC_MDA_W1_0_DFMT1_DIDB(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W1_0_DFMT1_DIDB_SHIFT)) & CPE_XRDC_MDA_W1_0_DFMT1_DIDB_MASK)

#define CPE_XRDC_MDA_W1_0_DFMT1_LPID_MASK        (0xF000000U)
#define CPE_XRDC_MDA_W1_0_DFMT1_LPID_SHIFT       (24U)
#define CPE_XRDC_MDA_W1_0_DFMT1_LPID_WIDTH       (4U)
#define CPE_XRDC_MDA_W1_0_DFMT1_LPID(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W1_0_DFMT1_LPID_SHIFT)) & CPE_XRDC_MDA_W1_0_DFMT1_LPID_MASK)

#define CPE_XRDC_MDA_W1_0_DFMT1_LPE_MASK         (0x10000000U)
#define CPE_XRDC_MDA_W1_0_DFMT1_LPE_SHIFT        (28U)
#define CPE_XRDC_MDA_W1_0_DFMT1_LPE_WIDTH        (1U)
#define CPE_XRDC_MDA_W1_0_DFMT1_LPE(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W1_0_DFMT1_LPE_SHIFT)) & CPE_XRDC_MDA_W1_0_DFMT1_LPE_MASK)

#define CPE_XRDC_MDA_W1_0_DFMT1_DFMT_MASK        (0x20000000U)
#define CPE_XRDC_MDA_W1_0_DFMT1_DFMT_SHIFT       (29U)
#define CPE_XRDC_MDA_W1_0_DFMT1_DFMT_WIDTH       (1U)
#define CPE_XRDC_MDA_W1_0_DFMT1_DFMT(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W1_0_DFMT1_DFMT_SHIFT)) & CPE_XRDC_MDA_W1_0_DFMT1_DFMT_MASK)

