zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_XRDC.h
#define CPE_XRDC_MDA_W2_3_DFMT1_LPE_MASK         (0x10000000U)
#define CPE_XRDC_MDA_W2_3_DFMT1_LPE_SHIFT        (28U)
#define CPE_XRDC_MDA_W2_3_DFMT1_LPE_WIDTH        (1U)
#define CPE_XRDC_MDA_W2_3_DFMT1_LPE(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W2_3_DFMT1_LPE_SHIFT)) & CPE_XRDC_MDA_W2_3_DFMT1_LPE_MASK)

#define CPE_XRDC_MDA_W2_3_DFMT1_DFMT_MASK        (0x20000000U)
#define CPE_XRDC_MDA_W2_3_DFMT1_DFMT_SHIFT       (29U)
#define CPE_XRDC_MDA_W2_3_DFMT1_DFMT_WIDTH       (1U)
#define CPE_XRDC_MDA_W2_3_DFMT1_DFMT(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W2_3_DFMT1_DFMT_SHIFT)) & CPE_XRDC_MDA_W2_3_DFMT1_DFMT_MASK)

#define CPE_XRDC_MDA_W2_3_DFMT1_LK1_MASK         (0x40000000U)
#define CPE_XRDC_MDA_W2_3_DFMT1_LK1_SHIFT        (30U)
#define CPE_XRDC_MDA_W2_3_DFMT1_LK1_WIDTH        (1U)
#define CPE_XRDC_MDA_W2_3_DFMT1_LK1(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W2_3_DFMT1_LK1_SHIFT)) & CPE_XRDC_MDA_W2_3_DFMT1_LK1_MASK)

#define CPE_XRDC_MDA_W2_3_DFMT1_VLD_MASK         (0x80000000U)
#define CPE_XRDC_MDA_W2_3_DFMT1_VLD_SHIFT        (31U)
#define CPE_XRDC_MDA_W2_3_DFMT1_VLD_WIDTH        (1U)
#define CPE_XRDC_MDA_W2_3_DFMT1_VLD(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W2_3_DFMT1_VLD_SHIFT)) & CPE_XRDC_MDA_W2_3_DFMT1_VLD_MASK)
/*! @} */

/*! @name MDA_W3_3_DFMT1 - Master Domain Assignment */
/*! @{ */

#define CPE_XRDC_MDA_W3_3_DFMT1_DID_MASK         (0xFU)
#define CPE_XRDC_MDA_W3_3_DFMT1_DID_SHIFT        (0U)
#define CPE_XRDC_MDA_W3_3_DFMT1_DID_WIDTH        (4U)
#define CPE_XRDC_MDA_W3_3_DFMT1_DID(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W3_3_DFMT1_DID_SHIFT)) & CPE_XRDC_MDA_W3_3_DFMT1_DID_MASK)

#define CPE_XRDC_MDA_W3_3_DFMT1_PA_MASK          (0x30U)
#define CPE_XRDC_MDA_W3_3_DFMT1_PA_SHIFT         (4U)
#define CPE_XRDC_MDA_W3_3_DFMT1_PA_WIDTH         (2U)
#define CPE_XRDC_MDA_W3_3_DFMT1_PA(x)            (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W3_3_DFMT1_PA_SHIFT)) & CPE_XRDC_MDA_W3_3_DFMT1_PA_MASK)

#define CPE_XRDC_MDA_W3_3_DFMT1_SA_MASK          (0xC0U)
#define CPE_XRDC_MDA_W3_3_DFMT1_SA_SHIFT         (6U)
#define CPE_XRDC_MDA_W3_3_DFMT1_SA_WIDTH         (2U)
#define CPE_XRDC_MDA_W3_3_DFMT1_SA(x)            (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W3_3_DFMT1_SA_SHIFT)) & CPE_XRDC_MDA_W3_3_DFMT1_SA_MASK)

#define CPE_XRDC_MDA_W3_3_DFMT1_DIDB_MASK        (0x100U)
#define CPE_XRDC_MDA_W3_3_DFMT1_DIDB_SHIFT       (8U)
#define CPE_XRDC_MDA_W3_3_DFMT1_DIDB_WIDTH       (1U)
#define CPE_XRDC_MDA_W3_3_DFMT1_DIDB(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W3_3_DFMT1_DIDB_SHIFT)) & CPE_XRDC_MDA_W3_3_DFMT1_DIDB_MASK)

#define CPE_XRDC_MDA_W3_3_DFMT1_LPID_MASK        (0xF000000U)
#define CPE_XRDC_MDA_W3_3_DFMT1_LPID_SHIFT       (24U)
#define CPE_XRDC_MDA_W3_3_DFMT1_LPID_WIDTH       (4U)
#define CPE_XRDC_MDA_W3_3_DFMT1_LPID(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W3_3_DFMT1_LPID_SHIFT)) & CPE_XRDC_MDA_W3_3_DFMT1_LPID_MASK)

#define CPE_XRDC_MDA_W3_3_DFMT1_LPE_MASK         (0x10000000U)
#define CPE_XRDC_MDA_W3_3_DFMT1_LPE_SHIFT        (28U)
#define CPE_XRDC_MDA_W3_3_DFMT1_LPE_WIDTH        (1U)
#define CPE_XRDC_MDA_W3_3_DFMT1_LPE(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W3_3_DFMT1_LPE_SHIFT)) & CPE_XRDC_MDA_W3_3_DFMT1_LPE_MASK)

#define CPE_XRDC_MDA_W3_3_DFMT1_DFMT_MASK        (0x20000000U)
#define CPE_XRDC_MDA_W3_3_DFMT1_DFMT_SHIFT       (29U)
#define CPE_XRDC_MDA_W3_3_DFMT1_DFMT_WIDTH       (1U)
#define CPE_XRDC_MDA_W3_3_DFMT1_DFMT(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W3_3_DFMT1_DFMT_SHIFT)) & CPE_XRDC_MDA_W3_3_DFMT1_DFMT_MASK)

#define CPE_XRDC_MDA_W3_3_DFMT1_LK1_MASK         (0x40000000U)
#define CPE_XRDC_MDA_W3_3_DFMT1_LK1_SHIFT        (30U)
#define CPE_XRDC_MDA_W3_3_DFMT1_LK1_WIDTH        (1U)
#define CPE_XRDC_MDA_W3_3_DFMT1_LK1(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W3_3_DFMT1_LK1_SHIFT)) & CPE_XRDC_MDA_W3_3_DFMT1_LK1_MASK)

#define CPE_XRDC_MDA_W3_3_DFMT1_VLD_MASK         (0x80000000U)
#define CPE_XRDC_MDA_W3_3_DFMT1_VLD_SHIFT        (31U)
#define CPE_XRDC_MDA_W3_3_DFMT1_VLD_WIDTH        (1U)
#define CPE_XRDC_MDA_W3_3_DFMT1_VLD(x)           (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_MDA_W3_3_DFMT1_VLD_SHIFT)) & CPE_XRDC_MDA_W3_3_DFMT1_VLD_MASK)
/*! @} */

/*! @name PDAC_W0 - Peripheral Domain Access Control Word 0 */
/*! @{ */

#define CPE_XRDC_PDAC_W0_D0ACP_MASK              (0x7U)
#define CPE_XRDC_PDAC_W0_D0ACP_SHIFT             (0U)
#define CPE_XRDC_PDAC_W0_D0ACP_WIDTH             (3U)
#define CPE_XRDC_PDAC_W0_D0ACP(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_PDAC_W0_D0ACP_SHIFT)) & CPE_XRDC_PDAC_W0_D0ACP_MASK)

#define CPE_XRDC_PDAC_W0_D1ACP_MASK              (0x38U)
#define CPE_XRDC_PDAC_W0_D1ACP_SHIFT             (3U)
#define CPE_XRDC_PDAC_W0_D1ACP_WIDTH             (3U)
#define CPE_XRDC_PDAC_W0_D1ACP(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_PDAC_W0_D1ACP_SHIFT)) & CPE_XRDC_PDAC_W0_D1ACP_MASK)

#define CPE_XRDC_PDAC_W0_D2ACP_MASK              (0x1C0U)
#define CPE_XRDC_PDAC_W0_D2ACP_SHIFT             (6U)
#define CPE_XRDC_PDAC_W0_D2ACP_WIDTH             (3U)
#define CPE_XRDC_PDAC_W0_D2ACP(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_PDAC_W0_D2ACP_SHIFT)) & CPE_XRDC_PDAC_W0_D2ACP_MASK)

#define CPE_XRDC_PDAC_W0_D3ACP_MASK              (0xE00U)
#define CPE_XRDC_PDAC_W0_D3ACP_SHIFT             (9U)
#define CPE_XRDC_PDAC_W0_D3ACP_WIDTH             (3U)
#define CPE_XRDC_PDAC_W0_D3ACP(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_PDAC_W0_D3ACP_SHIFT)) & CPE_XRDC_PDAC_W0_D3ACP_MASK)

#define CPE_XRDC_PDAC_W0_D4ACP_MASK              (0x7000U)
#define CPE_XRDC_PDAC_W0_D4ACP_SHIFT             (12U)
#define CPE_XRDC_PDAC_W0_D4ACP_WIDTH             (3U)
#define CPE_XRDC_PDAC_W0_D4ACP(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_PDAC_W0_D4ACP_SHIFT)) & CPE_XRDC_PDAC_W0_D4ACP_MASK)

#define CPE_XRDC_PDAC_W0_D5ACP_MASK              (0x38000U)
#define CPE_XRDC_PDAC_W0_D5ACP_SHIFT             (15U)
#define CPE_XRDC_PDAC_W0_D5ACP_WIDTH             (3U)
#define CPE_XRDC_PDAC_W0_D5ACP(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_PDAC_W0_D5ACP_SHIFT)) & CPE_XRDC_PDAC_W0_D5ACP_MASK)

#define CPE_XRDC_PDAC_W0_D6ACP_MASK              (0x1C0000U)
#define CPE_XRDC_PDAC_W0_D6ACP_SHIFT             (18U)
#define CPE_XRDC_PDAC_W0_D6ACP_WIDTH             (3U)
#define CPE_XRDC_PDAC_W0_D6ACP(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_PDAC_W0_D6ACP_SHIFT)) & CPE_XRDC_PDAC_W0_D6ACP_MASK)

#define CPE_XRDC_PDAC_W0_D7ACP_MASK              (0xE00000U)
#define CPE_XRDC_PDAC_W0_D7ACP_SHIFT             (21U)
#define CPE_XRDC_PDAC_W0_D7ACP_WIDTH             (3U)
#define CPE_XRDC_PDAC_W0_D7ACP(x)                (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_PDAC_W0_D7ACP_SHIFT)) & CPE_XRDC_PDAC_W0_D7ACP_MASK)

#define CPE_XRDC_PDAC_W0_SNUM_MASK               (0xF000000U)
#define CPE_XRDC_PDAC_W0_SNUM_SHIFT              (24U)
#define CPE_XRDC_PDAC_W0_SNUM_WIDTH              (4U)
#define CPE_XRDC_PDAC_W0_SNUM(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_PDAC_W0_SNUM_SHIFT)) & CPE_XRDC_PDAC_W0_SNUM_MASK)

