zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_XRDC.h
#define CPE_XRDC_XRDC_MRGD_W3_D11ACP_MASK        (0xE00U)
#define CPE_XRDC_XRDC_MRGD_W3_D11ACP_SHIFT       (9U)
#define CPE_XRDC_XRDC_MRGD_W3_D11ACP_WIDTH       (3U)
#define CPE_XRDC_XRDC_MRGD_W3_D11ACP(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_XRDC_MRGD_W3_D11ACP_SHIFT)) & CPE_XRDC_XRDC_MRGD_W3_D11ACP_MASK)

#define CPE_XRDC_XRDC_MRGD_W3_D12ACP_MASK        (0x7000U)
#define CPE_XRDC_XRDC_MRGD_W3_D12ACP_SHIFT       (12U)
#define CPE_XRDC_XRDC_MRGD_W3_D12ACP_WIDTH       (3U)
#define CPE_XRDC_XRDC_MRGD_W3_D12ACP(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_XRDC_MRGD_W3_D12ACP_SHIFT)) & CPE_XRDC_XRDC_MRGD_W3_D12ACP_MASK)

#define CPE_XRDC_XRDC_MRGD_W3_D13ACP_MASK        (0x38000U)
#define CPE_XRDC_XRDC_MRGD_W3_D13ACP_SHIFT       (15U)
#define CPE_XRDC_XRDC_MRGD_W3_D13ACP_WIDTH       (3U)
#define CPE_XRDC_XRDC_MRGD_W3_D13ACP(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_XRDC_MRGD_W3_D13ACP_SHIFT)) & CPE_XRDC_XRDC_MRGD_W3_D13ACP_MASK)

#define CPE_XRDC_XRDC_MRGD_W3_D14ACP_MASK        (0x1C0000U)
#define CPE_XRDC_XRDC_MRGD_W3_D14ACP_SHIFT       (18U)
#define CPE_XRDC_XRDC_MRGD_W3_D14ACP_WIDTH       (3U)
#define CPE_XRDC_XRDC_MRGD_W3_D14ACP(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_XRDC_MRGD_W3_D14ACP_SHIFT)) & CPE_XRDC_XRDC_MRGD_W3_D14ACP_MASK)

#define CPE_XRDC_XRDC_MRGD_W3_D15ACP_MASK        (0xE00000U)
#define CPE_XRDC_XRDC_MRGD_W3_D15ACP_SHIFT       (21U)
#define CPE_XRDC_XRDC_MRGD_W3_D15ACP_WIDTH       (3U)
#define CPE_XRDC_XRDC_MRGD_W3_D15ACP(x)          (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_XRDC_MRGD_W3_D15ACP_SHIFT)) & CPE_XRDC_XRDC_MRGD_W3_D15ACP_MASK)

#define CPE_XRDC_XRDC_MRGD_W3_LK2_MASK           (0x60000000U)
#define CPE_XRDC_XRDC_MRGD_W3_LK2_SHIFT          (29U)
#define CPE_XRDC_XRDC_MRGD_W3_LK2_WIDTH          (2U)
#define CPE_XRDC_XRDC_MRGD_W3_LK2(x)             (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_XRDC_MRGD_W3_LK2_SHIFT)) & CPE_XRDC_XRDC_MRGD_W3_LK2_MASK)

#define CPE_XRDC_XRDC_MRGD_W3_VLD_MASK           (0x80000000U)
#define CPE_XRDC_XRDC_MRGD_W3_VLD_SHIFT          (31U)
#define CPE_XRDC_XRDC_MRGD_W3_VLD_WIDTH          (1U)
#define CPE_XRDC_XRDC_MRGD_W3_VLD(x)             (((uint32_t)(((uint32_t)(x)) << CPE_XRDC_XRDC_MRGD_W3_VLD_SHIFT)) & CPE_XRDC_XRDC_MRGD_W3_VLD_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group CPE_XRDC_Register_Masks */

/*!
 * @}
 */ /* end of group CPE_XRDC_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_CPE_XRDC_H_) */
